ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(5), # data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%Artikel kelima%' ESCAPE '!'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%Artikel kelima%' ESCAPE '!'

    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel ketigabelas', 'Wang Chang (Chinese: 王昶; pinyin: Wáng Chǎng; born 7 May 2001) is a Chinese badminton player. Born in Ningbo, Zhejiang, Wang who trained in Ningbo training centre, entered the provincial team in 2015, and in the national team in 2017.', 'Artikel-ketigabelas')